n=int(input("Dwse n: "))        #δινω το 'n' και το αποθηκευω στην μεταβλητη 'n' οπου αυτο που εδωσα το μετατρεπω σε ακεραιο αριθμο
m=int(input("Dwse m: "))        #δινω το 'm' και το αποθηκευω στην μεταβλητη 'm' οπου αυτο που εδωσα το μετατρεπω σε ακεραιο αριθμο
i=1                             #θετω μια μεταβλητη 'i' να ισουται με '1'
sum=0                           #αρχειοθετω τον αθροιστη μου με '0'
var1=i*n                        #θετω μια μεταβληρη 'var1' η οποια θα μ δειχνει τα πολλαπλασια του 'n'
while var1<=m:                  #οσο το πολλαπλασιο ειναι μικροτερο της μεταβλητης 'm' θα επαναλαμπαβνει:
    sum=var1+sum                #προσθετω τα πολλαπλασια του 'n'
    var1=var1+var1              #πηγαινω στο επομενο πολλαπλασιο
print(sum)                      #βγαζω στην οθονη το αθροισμα


